[{"title":"Windows - Time Saving","tipsCount":"13 Hacks","imagePath":"images/computer.jpg","informationList":[{"tipId":"6","tips":"Put all your favorite applications, dial-up connections, folders and documents on the Quick Launch bar. Forget about the Start button. You can put about 20 things on the Quick Launch bar for easy one-click access. Use it. When an item falls out of use, erase the shortcut. They're only shortcuts, so it doesn't matter if you erase them."},{"tipId":"5","tips":"To close a foreground program or window, press Alt+F4. It's that easy. Alternatively, right-click its button on the taskbar and choose Close. Aiming for that little X in the upper-right corner takes too much mouse movement."},{"tipId":"4","tips":"Double-click a window's title bar to make it go full screen. Editing in little windows on the screen is a hassle and requires unnecessary scrolling."},{"tipId":"8","tips":"Those little double arrows appear in many locations throughout the user experience. You'll see them on the Quick Launch bar, the notification area, ends of toolbars and more. They simply indicate that either more data is available but it's currently hidden from view, or all data is currently displayed but it can be hidden or reduced in size. In some cases, the double arrows are a toggle between minimum and expanded views; other times, the double arrows display the hidden items when clicked but return to their previous display after you make a selection or click somewhere else."},{"tipId":"11","tips":"If you use a laptop in the office, get a good external keyboard to work with it. Your hands will probably be happier, and you'll type faster. Also get a pointing device that works best for you. Those 'pointing stick' mice are not for everyone. Try a few different pointing devices and come up with one that works best for you."},{"tipId":"9","tips":"If you use a laptop in the office, get a good external keyboard to work with it. Your hands will probably be happier, and you'll type faster. Also get a pointing device that works best for you. Those 'pointing stick' mice are not for everyone. Try a few different pointing devices and come up with one that works best for you."},{"tipId":"3","tips":"Having programs running in the background only boosts your productivity if you’re actually using them regularly. Right-click on a blank area of the taskbar and choose Task Manager then Processes to see what’s running (right-click on entries to close them)."},{"tipId":"13","tips":"In Word, Excel and many other applications, Ctrl+F6 is the key that switches between open windows within the same app. No need to click on the Window menu in the application and choose the document in question. Just cycle through them with Ctrl+F6."},{"tipId":"12","tips":"Also in Windows Mail, you can reply to an e-mail with Ctrl+R. Forward one with Ctrl+F. Send a message you've just written by pressing Ctrl+Enter. Send and receive all mail with Ctrl+M."},{"tipId":"1","tips":"To get to the desktop (minimize all open windows), press the Windows key and M at the same time. To reverse the effect, press Shift+Windows+M. This is a real time-saver. If you prefer the mouse, click the Show Desktop button in the Quick Launch bar; it does the same thing."},{"tipId":"2","tips":"Change between applications by pressing Alt+Tab. Aiming for an application's little button on the taskbar is a hassle. You'll get tendonitis doing that all day. If you're using the Aero interface, you can also use Flip 3D to change between applications by pressing Windows+Tab."},{"tipId":"10","tips":"Use Sleep and Hibernate. Don't boot up every time you turn on your computer; it's a waste of valuable time. Keep your favorite programs open: e-mail, word processor, picture viewer, Web browser, spreadsheet, whatever. Yes, do save your work and maybe even close your document, but leave the apps open and keep the machine in Sleep or Hibernate mode."},{"tipId":"7","tips":"If there are too many items within the Quick Launch bar to be displayed within the current area, two little arrows(>>) are displayed. This indicates that other Quick Launch icons are present but are currently hidden from view. To see the hidden icons, click on the double arrow to see a pop-up menu, or click and drag the edge of the main toolbar area (just to the right of the Quick Launch bar) to expand the space available for the Quick Launch bar."}]}]
