[{"title":"Grocery Shopping Tips ","tipsCount":"15 Hacks","imagePath":"images/grocery.jpg","informationList":[{"tipId":"1","tips":"Shop on a full stomach. You’ll buy less snacks and/or things you don’t usually buy - and only buy groceries, not gifts and all the extra stuff, at the grocery store!"},{"tipId":"13","tips":"Don’t buy snacks on the run. They are often less healthy and more expensive."},{"tipId":"5","tips":"Shop when you have energy and aren’t worn out from a busy day. It’s easier to focus and make wise choices when you’ve got energy and aren’t preoccupied."},{"tipId":"15","tips":" Look high and low – not in the middle. The most expensive items are usually put on the shelves where you can easily see and reach them. Some of the less expensive items may be on the higher or lower shelves."},{"tipId":"3","tips":"Plan your meals for the week before you shop and then buy what’s on the menu. Start with planning for 3 or 4 days if all week seems too much."},{"tipId":"14","tips":"Get to know the food prices. Write down the regular prices of foods you buy often. This will help you figure out which stores have the best prices and if you are getting a good deal on sale items."},{"tipId":"9","tips":"Buy less canned and packaged convenience foods and shred your own lettuce and cheese (cheeses often freeze well too!)."},{"tipId":"2","tips":"Go armed with a list and stick to it, especially if your kids are “helping”."},{"tipId":"8","tips":"Plan meals so that you have leftovers for lunch the next day, or freeze leftovers for a quick meal another day."},{"tipId":"6","tips":"Return your bottles and cans for the deposit that you paid. If you've got kids, get them to help with this job and let them keep the cash they earn."},{"tipId":"10","tips":"Clean out your fridge and cupboards once a month. Use up what you bought before buying more."},{"tipId":"4","tips":"Shop only once a week. You’ll tend to spend more if you stop at the store every day or several times a week."},{"tipId":"12","tips":"Spend some time once a week washing and/or cutting up fruit and vegetables. This will speed up dinner and lunch preparations and provide healthy snacks that are ready to go."},{"tipId":"7","tips":"Shop in familiar stores when you’re tired, stressed or in a hurry. You’ll find what you need and be able to get out with what you need quickly."},{"tipId":"11","tips":"Organize your food storage cupboards and drawers. If you don’t know what you have or can’t find what you bought, you’ll end up buying more of the same unnecessarily."}]},{"title":"Saving Money On Travel  ","tipsCount":"14 Hacks","imagePath":"images/travel.jpg","informationList":[{"tipId":"1","tips":"Generally, flying earlier in the week (Monday or Tuesday vs. Thursday or Friday) translates to better deals, and the second flight of the day is less expensive than the first."},{"tipId":"2","tips":"Little, rentable mobile routers — nicknamed 'pocket WiFi' — are becoming more available in places like Europe and Japan. Typically you reserve one, then pick it up at the airport or have it delivered to your hotel. They cost a low per-day fee, and will save you from international roaming charges, paying for hotel WiFi if it’s not gratis, or having to buy a coffee every time you want to use a cafe’s WiFi but you realize that it’s password protected so you can't 'borrow' it from outside."},{"tipId":"3","tips":"You can’t negotiate with a computer. So even if you’ve booked online, I’d suggest trying to negotiate upgrades or special requests — like a late checkout — in person. You’re more likely to get the best possible deal when you’re talking to someone (kindly) face to face."},{"tipId":"4","tips":"There’s no better way to get to know a new city than by walking everywhere. That you’ll end up saving a fortune in taxis is a nice bonus. And when you do need a ride, opt for public transportation and know that frequent-travel cards — the Oyster card in London, the Octopus in Hong Kong — are much smarter than single fares."},{"tipId":"5","tips":"<b>Do not touch your mini-bar</b>This is not a tip, it is gospel! Opening the mini bar in a Indian hotel room comes with a host of other problems – one of them being a hefty addition to your bill. And don’t think you can use the snacks and beverages in a crunch and replace them with the same from the market – the scheming authorities stamp the stuff!"},{"tipId":"6","tips":"<b>Travel off-season</b>Off-season is actually on-season where India is concerned. Rest assured; you will save a chunk of change if you book when the herd is not heading toward India. Hotels, even luxurious and unaffordable five star ones welcome you with package deals, and wait on you hand and foot. Take for example the ridiculously expensive hotels in Goa, Rajasthan and Kerala"},{"tipId":"7","tips":"<b>Don’t wait to book your flights</b>Most domestic airlines in India offer discounts if you book in advance. So get onto the net and book your seats well in time, because fares keep getting pricier as the date of journey approaches. You will end up paying about half of what a last minute ticket will cost you! Another trick is to book mid-day flights – other than the fact that it shaves precious sightseeing hours off your itinerary, it definitely adds to your savings account! Mid-day flights are way cheaper than early morning or later in the evening flights. So eat your lunch en route! Another good idea is to avoid weekend flights – more the demand, higher the price."},{"tipId":"8","tips":"<b>Grab a holiday package</b>Take advantage of today’s sluggish economy and go for the flight plus hotel combos that online travel agents don’t seem to tire of advertising. These combination deals help you save around 30% as compared to separate bookings. Also get lucky with packages that offer flights with multiple destinations. So keep a lookout for your online bonanza!"},{"tipId":"9","tips":"<b>The upside of taking the train</b>This tip is not for those unfamiliar with the Indian Railways or for those who recoil in horror at the sight of a typical Indian city railway station. For the rest of us, it is business as usual – travelling by train around India is pretty safe and very economical. More plus points are the view and the unprecedented local interaction one experiences. Catching a night train gives you a double boost in terms of saving hotel money for the night and increasing your sightseeing hour quota. Hot tip though – avoid shady people offering you snacks or drinks!"},{"tipId":"10","tips":"<b>Book with breakfast</b>Single out hotels that offer one meal in the tariff – preferably breakfast – we’re hoping the rest of the day is spent sightseeing! Room service can be quite prohibitive, plus how dull is it to miss out on local food?"},{"tipId":"11","tips":"<b>Carry your own food</b>In no way are we suggesting that you pass up local delicacies for packaged, instant food. We merely advise that you have a back-up in case you find yourself in a situation where the only culinary option is prohibitively expensive. If you’re in the mountains, then you must carry emergency ration; but elsewhere, not so much. Digging into local street food really helps save money, but remember you’ve got to have the stomach for it – literally!"},{"tipId":"12","tips":"<b>Educate yourself in car rentals</b>Don’t get conned by cunning taxi drivers – try to book your cabs online through known companies. It is safer, cheaper and more reliable. If you must book a local; go for a diesel vehicle – it is way cheaper. If you are on your own, give a two wheeler a shot – less cumbersome and easier on the pocket."},{"tipId":"13","tips":"<b>Your guide/driver is not a culinary or shopping specialist</b>Never ever shop or eat at places recommended by your guide or cabbie – they are bound to have a commission on the bill you generate. A good idea is to check with locals or fellow tourists."},{"tipId":"14","tips":"<b>Bargain till you drop</b>Use the gift of the gab and knock that price down! It could be room rent, cab fare, or souvenir shopping – a good bargain never hurt anyone. If you don’t manage a reduction in rate, you will certainly be offered an upgrade of a free gift."}]}]
