[{"title":"Food & Beverage","tipsCount":"17 Hacks","imagePath":"images/food.jpg","informationList":[{"tipId":"7","tips":"Another way to save on washing up, and time, is by making one pot meals such as the aforementioned soups, chili and stews. They make life a lot easier and ingredients can often just be thrown in and left. You have to love low-maintenance meals!"},{"tipId":"11","tips":"If you want to make meal prep super quick, it’s all about the order in which you cook. Look at the items you have planned for your meal and start with the item that takes the longest to cook. For example, if you have a recipe component like chicken that takes 30 minutes to cook in the oven, you’d start that first, and then once that goes in to cook, you can prepare other items, such as a green salad.Meal prepping is all about organization. And healthy meal prep is worth it. Use these 10 tips to get organized, save time, and start enjoying healthy meal prep every week."},{"tipId":"10","tips":"This may sound like an odd addition, but there is a method to my madness. Having a cluttered and disorganized bench space will make things harder to find and thus increase your cooking time. Get neat and organized beforehand!"},{"tipId":"9","tips":"If you want the effects of a slow cooker but don’t want to wait all day, a pressure cooker is the answer. It does basically the same thing, but in an insanely short amount of time. There is a scientific explanation behind it, but I prefer to attribute it to magic."},{"tipId":"12","tips":"Instead of cooking every night, cook big batches to freeze. If you have a few hours spare, cook a few different things. A freezer full of precooked meals makes life much easier and happier when you’re too tired to cook. It will also prevent you from opting for fast food when you have such a convenient choice already available."},{"tipId":"1","tips":"I know it can be tempting to dive right in, especially if you’re in a rush, but this is a serious mistake. Not having a good idea of what you need to do ahead of time can end up costing you more time later. Do you really want to double check ingredients quantities 10 times before eventually realizing that you forgot an entire step?"},{"tipId":"14","tips":"If you want to really save time when meal prepping, batch cook staple foods and use them to compile meals throughout the week. Pick proteins, carbohydrates, and veggies so you have a variety of foods to choose from. Here are some examples:\r\nRoasted chicken\r\nSalmon\r\nQuinoa\r\nBrown rice\r\nRoasted broccoli and cauliflower\r\nRoasted carrots\r\nDiced bell peppers\r\nMixed greens"},{"tipId":"8","tips":"If you’re looking for some additional convenience, invest in a slow cooker. There is really nothing better than coming home after a long day to the delicious smell of dinner that’s already done. Plus, slow cooked food tends to be so much more tender and flavorsome."},{"tipId":"17","tips":"Read the full recipe before cooking. This seems so simple, but sometimes we get in such a rush to cook that we forget to read the recipe before starting. Keep a time-consuming step from blindsiding you by reading through the whole recipe before you start. That way, you'll be prepared for any daunting step before you get to it. Want to really be prepared? Use this read-ahead time to assemble your ingredients in prep bowls so you won't be digging through your spice cabinet at the last second."},{"tipId":"6","tips":"The absolute worst part of cooking is the washing up, so why make it harder on yourself? Avoid a huge pile of agony at the end of a meal by cleaning as you go. Your future self will thank you for it."},{"tipId":"4","tips":"This saves on time and benefits your body because the best nutrients can be be found in vegetable skins."},{"tipId":"13","tips":"This isn’t so much of a time saver as it is a water saver. Instead of tipping out boiled water, pour it over your sponges to kill off germs. Alternatively, wait for the water to cool and then use it on your garden."},{"tipId":"15","tips":"Make a recipe book. Take things one step further and actually put together a physical recipe book, Pitts suggests. “It can be frustrating and time consuming trying to remember or find your favorite healthy meals online or digging through old recipe books,” she says. “To keep track of healthy meals you like and would like to make again, create your own healthy-cooking notebook and store it in a designated place to quickly reference anytime.”"},{"tipId":"3","tips":"Look at everything on your ingredients list and if there’s anything that can be chopped, peeled or blended ahead of time, do it. This will save loads of time when it comes to cooking, and will make the whole process less stressful in general. I particularly like doing this the night before I plan on slow cooking a meal because I want as many extra minutes of sleep in the morning as possible."},{"tipId":"5","tips":"Don’t throw out those vegetable peels or meat cuttings, they can be incredibly useful! I like to freeze mine in order to make stock for soups, chili and stews. If you’re not a fan of making your own stock, save those peelings for the compost heap. Every little bit of recycling helps the planet!"},{"tipId":"2","tips":"Knives can be an expensive investment, but they’re well worth it. Not only will they chop things more effectively, they’ll also help you to cut things up much faster. Make sure that you also take proper care of them by sharpening them regularly and not leaving them exposed inside drawers."},{"tipId":"16","tips":"Carry snacks with you.\r\nIf you really don’t have time for a meal, you want to make sure you at least have some healthy snacks you can grab to keep yourself satiated until you can sit down for a proper meal. Spence suggests stocking up on and carrying portable snacks that can curb hunger and fuel you quickly on the go. “I like to stash granola bars in my bags so I always have something ‘just in case.’ Other great options are pre-mixing trail mix with a combo of cereal, nuts, dried fruit, chocolate chips, seeds, etc.,” she suggests."}]}]
