[{"title":"Grocery Shopping Tips ","tipsCount":"15 Hacks","imagePath":"images/grocery.jpg","informationList":[{"tipId":"1","tips":"Shop on a full stomach. You’ll buy less snacks and/or things you don’t usually buy - and only buy groceries, not gifts and all the extra stuff, at the grocery store!"},{"tipId":"2","tips":"Go armed with a list and stick to it, especially if your kids are “helping”."},{"tipId":"3","tips":"Plan your meals for the week before you shop and then buy what’s on the menu. Start with planning for 3 or 4 days if all week seems too much."},{"tipId":"4","tips":"Shop only once a week. You’ll tend to spend more if you stop at the store every day or several times a week."},{"tipId":"5","tips":"Shop when you have energy and aren’t worn out from a busy day. It’s easier to focus and make wise choices when you’ve got energy and aren’t preoccupied."},{"tipId":"6","tips":"Return your bottles and cans for the deposit that you paid. If you've got kids, get them to help with this job and let them keep the cash they earn."},{"tipId":"7","tips":"Shop in familiar stores when you’re tired, stressed or in a hurry. You’ll find what you need and be able to get out with what you need quickly."},{"tipId":"8","tips":"Plan meals so that you have leftovers for lunch the next day, or freeze leftovers for a quick meal another day."},{"tipId":"9","tips":"Buy less canned and packaged convenience foods and shred your own lettuce and cheese (cheeses often freeze well too!)."},{"tipId":"10","tips":"Clean out your fridge and cupboards once a month. Use up what you bought before buying more."},{"tipId":"11","tips":"Organize your food storage cupboards and drawers. If you don’t know what you have or can’t find what you bought, you’ll end up buying more of the same unnecessarily."},{"tipId":"12","tips":"Spend some time once a week washing and/or cutting up fruit and vegetables. This will speed up dinner and lunch preparations and provide healthy snacks that are ready to go."},{"tipId":"13","tips":"Don’t buy snacks on the run. They are often less healthy and more expensive."},{"tipId":"14","tips":"Get to know the food prices. Write down the regular prices of foods you buy often. This will help you figure out which stores have the best prices and if you are getting a good deal on sale items."},{"tipId":"15","tips":" Look high and low – not in the middle. The most expensive items are usually put on the shelves where you can easily see and reach them. Some of the less expensive items may be on the higher or lower shelves."}]},{"title":"Windows - Time Saving","tipsCount":"13 Hacks","imagePath":"images/computer.jpg","informationList":[{"tipId":"1","tips":"To get to the desktop (minimize all open windows), press the Windows key and M at the same time. To reverse the effect, press Shift+Windows+M. This is a real time-saver. If you prefer the mouse, click the Show Desktop button in the Quick Launch bar; it does the same thing."},{"tipId":"2","tips":"Change between applications by pressing Alt+Tab. Aiming for an application's little button on the taskbar is a hassle. You'll get tendonitis doing that all day. If you're using the Aero interface, you can also use Flip 3D to change between applications by pressing Windows+Tab."},{"tipId":"3","tips":"Having programs running in the background only boosts your productivity if you’re actually using them regularly. Right-click on a blank area of the taskbar and choose Task Manager then Processes to see what’s running (right-click on entries to close them)."},{"tipId":"4","tips":"Double-click a window's title bar to make it go full screen. Editing in little windows on the screen is a hassle and requires unnecessary scrolling."},{"tipId":"5","tips":"To close a foreground program or window, press Alt+F4. It's that easy. Alternatively, right-click its button on the taskbar and choose Close. Aiming for that little X in the upper-right corner takes too much mouse movement."},{"tipId":"6","tips":"Put all your favorite applications, dial-up connections, folders and documents on the Quick Launch bar. Forget about the Start button. You can put about 20 things on the Quick Launch bar for easy one-click access. Use it. When an item falls out of use, erase the shortcut. They're only shortcuts, so it doesn't matter if you erase them."},{"tipId":"7","tips":"If there are too many items within the Quick Launch bar to be displayed within the current area, two little arrows(>>) are displayed. This indicates that other Quick Launch icons are present but are currently hidden from view. To see the hidden icons, click on the double arrow to see a pop-up menu, or click and drag the edge of the main toolbar area (just to the right of the Quick Launch bar) to expand the space available for the Quick Launch bar."},{"tipId":"8","tips":"Those little double arrows appear in many locations throughout the user experience. You'll see them on the Quick Launch bar, the notification area, ends of toolbars and more. They simply indicate that either more data is available but it's currently hidden from view, or all data is currently displayed but it can be hidden or reduced in size. In some cases, the double arrows are a toggle between minimum and expanded views; other times, the double arrows display the hidden items when clicked but return to their previous display after you make a selection or click somewhere else."},{"tipId":"9","tips":"If you use a laptop in the office, get a good external keyboard to work with it. Your hands will probably be happier, and you'll type faster. Also get a pointing device that works best for you. Those 'pointing stick' mice are not for everyone. Try a few different pointing devices and come up with one that works best for you."},{"tipId":"10","tips":"Use Sleep and Hibernate. Don't boot up every time you turn on your computer; it's a waste of valuable time. Keep your favorite programs open: e-mail, word processor, picture viewer, Web browser, spreadsheet, whatever. Yes, do save your work and maybe even close your document, but leave the apps open and keep the machine in Sleep or Hibernate mode."},{"tipId":"11","tips":"If you use a laptop in the office, get a good external keyboard to work with it. Your hands will probably be happier, and you'll type faster. Also get a pointing device that works best for you. Those 'pointing stick' mice are not for everyone. Try a few different pointing devices and come up with one that works best for you."},{"tipId":"12","tips":"Also in Windows Mail, you can reply to an e-mail with Ctrl+R. Forward one with Ctrl+F. Send a message you've just written by pressing Ctrl+Enter. Send and receive all mail with Ctrl+M."},{"tipId":"13","tips":"In Word, Excel and many other applications, Ctrl+F6 is the key that switches between open windows within the same app. No need to click on the Window menu in the application and choose the document in question. Just cycle through them with Ctrl+F6."}]},{"title":"miscellaneous","tipsCount":"17 Hacks","imagePath":"images/misc.jpg","informationList":[{"tipId":"1","tips":"Plan your day before it unfolds. Do it in the morning or even better, the night before you sleep. The plan gives you a good overview of how the day will pan out. That way, you don’t get caught off guard. Your job for the day is to stick to the plan as best as possible."},{"tipId":"2","tips":"Be clear that you need to finish X task by 10am, Y task by 3pm, and Z item by 5:30pm. This prevents your work from dragging on and eating into time reserved for other activities."},{"tipId":"3","tips":"Having a calendar is the most fundamental step to managing your daily activities. If you use outlook or lotus notes, calendar come as part of your mailing software. I use it. It’s even better if you can sync your calendar to your mobile phone and other hardwares you use – that way, you can access your schedule no matter where you are. Here’re the 10 Best Calendar Apps to Stay on Track ."},{"tipId":"4","tips":"An organizer helps you to be on top of everything in your life. It’s your central tool to organize information, to-do lists, projects, and other miscellaneous items."},{"tipId":"5","tips":"When do you need to finish your tasks? Mark the deadlines out clearly in your calendar and organizer so you know when you need to finish them."},{"tipId":"6","tips":"Don’t take on more than you can handle. For the distractions that come in when you’re doing other things, give a firm no. Or defer it to a later period."},{"tipId":"7","tips":"When you target to be on time, you’ll either be on time or late. Most of the times you’ll be late. However, if you target to be early, you’ll most likely be on time."},{"tipId":"8","tips":"Sometimes we are so engrossed in our work that we lose track of time. Having a huge clock in front of you will keep you aware of the time at the moment."},{"tipId":"9","tips":"Most calendars have a reminder function. If you have an important meeting to attend, set that alarm 15 minutes before."},{"tipId":"10","tips":"Are you multi-tasking so much that you’re just not getting anything done? If so, focus on just one key task at one time. Multitasking is bad for you. Close off all the applications you aren’t using. Close off the tabs in your browser that are taking away your attention. Focus solely on what you’re doing. You’ll be more efficient that way."},{"tipId":"11","tips":"What’s distracting you in your work? Instant messages? Phone ringing? Text messages popping in?I hardly ever use chat nowadays. The only times when I log on is when I’m not intending to do any work. Otherwise it gets very distracting. When I’m doing important work, I also switch off my phone. Calls during this time are recorded and I contact them afterward if it’s something important. This helps me concentrate better."},{"tipId":"12","tips":"When you start to track your time, you’re more aware of how you spend your time. For example, you can set a simple countdown timer to make sure that you finish a task within a period of time, say 30 minutes or 1 hour. The time pressure can push you to stay focused and work more efficiently."},{"tipId":"13","tips":"You’re never get everything done in exactly the way you want. Trying to do so is being ineffective."},{"tipId":"14","tips":"Since you can’t do everything, learn to prioritize the important and let go of the rest. Apply the 80/20 principle which is a key principle in prioritization."},{"tipId":"15","tips":"If there are things that can be better done by others or things that are not so important, consider delegating. This takes a load off and you can focus on the important tasks."},{"tipId":"16","tips":"For related work, batch them together.\r\n\r\nFor example, my work can be categorized into these core groups:\r\n1. writing (articles, my upcoming book)\r\n2. coaching\r\n3. workshop development\r\n4. business development\r\n5. administrative\r\nI batch all the related tasks together so there’s synergy. If I need to make calls, I allocate a time slot to make all my calls. It really streamlines the process."},{"tipId":"17","tips":"Don’t pack everything closely together. Leave a 5-10 minute buffer time in between each tasks. This helps you wrap up the previous task and start off on the next one."}]},{"title":"Food & Beverage","tipsCount":"17 Hacks","imagePath":"images/food.jpg","informationList":[{"tipId":"1","tips":"I know it can be tempting to dive right in, especially if you’re in a rush, but this is a serious mistake. Not having a good idea of what you need to do ahead of time can end up costing you more time later. Do you really want to double check ingredients quantities 10 times before eventually realizing that you forgot an entire step?"},{"tipId":"2","tips":"Knives can be an expensive investment, but they’re well worth it. Not only will they chop things more effectively, they’ll also help you to cut things up much faster. Make sure that you also take proper care of them by sharpening them regularly and not leaving them exposed inside drawers."},{"tipId":"3","tips":"Look at everything on your ingredients list and if there’s anything that can be chopped, peeled or blended ahead of time, do it. This will save loads of time when it comes to cooking, and will make the whole process less stressful in general. I particularly like doing this the night before I plan on slow cooking a meal because I want as many extra minutes of sleep in the morning as possible."},{"tipId":"4","tips":"This saves on time and benefits your body because the best nutrients can be be found in vegetable skins."},{"tipId":"5","tips":"Don’t throw out those vegetable peels or meat cuttings, they can be incredibly useful! I like to freeze mine in order to make stock for soups, chili and stews. If you’re not a fan of making your own stock, save those peelings for the compost heap. Every little bit of recycling helps the planet!"},{"tipId":"6","tips":"The absolute worst part of cooking is the washing up, so why make it harder on yourself? Avoid a huge pile of agony at the end of a meal by cleaning as you go. Your future self will thank you for it."},{"tipId":"7","tips":"Another way to save on washing up, and time, is by making one pot meals such as the aforementioned soups, chili and stews. They make life a lot easier and ingredients can often just be thrown in and left. You have to love low-maintenance meals!"},{"tipId":"8","tips":"If you’re looking for some additional convenience, invest in a slow cooker. There is really nothing better than coming home after a long day to the delicious smell of dinner that’s already done. Plus, slow cooked food tends to be so much more tender and flavorsome."},{"tipId":"9","tips":"If you want the effects of a slow cooker but don’t want to wait all day, a pressure cooker is the answer. It does basically the same thing, but in an insanely short amount of time. There is a scientific explanation behind it, but I prefer to attribute it to magic."},{"tipId":"10","tips":"This may sound like an odd addition, but there is a method to my madness. Having a cluttered and disorganized bench space will make things harder to find and thus increase your cooking time. Get neat and organized beforehand!"},{"tipId":"11","tips":"If you want to make meal prep super quick, it’s all about the order in which you cook. Look at the items you have planned for your meal and start with the item that takes the longest to cook. For example, if you have a recipe component like chicken that takes 30 minutes to cook in the oven, you’d start that first, and then once that goes in to cook, you can prepare other items, such as a green salad.Meal prepping is all about organization. And healthy meal prep is worth it. Use these 10 tips to get organized, save time, and start enjoying healthy meal prep every week."},{"tipId":"12","tips":"Instead of cooking every night, cook big batches to freeze. If you have a few hours spare, cook a few different things. A freezer full of precooked meals makes life much easier and happier when you’re too tired to cook. It will also prevent you from opting for fast food when you have such a convenient choice already available."},{"tipId":"13","tips":"This isn’t so much of a time saver as it is a water saver. Instead of tipping out boiled water, pour it over your sponges to kill off germs. Alternatively, wait for the water to cool and then use it on your garden."},{"tipId":"14","tips":"If you want to really save time when meal prepping, batch cook staple foods and use them to compile meals throughout the week. Pick proteins, carbohydrates, and veggies so you have a variety of foods to choose from. Here are some examples:\r\nRoasted chicken\r\nSalmon\r\nQuinoa\r\nBrown rice\r\nRoasted broccoli and cauliflower\r\nRoasted carrots\r\nDiced bell peppers\r\nMixed greens"},{"tipId":"15","tips":"Make a recipe book. Take things one step further and actually put together a physical recipe book, Pitts suggests. “It can be frustrating and time consuming trying to remember or find your favorite healthy meals online or digging through old recipe books,” she says. “To keep track of healthy meals you like and would like to make again, create your own healthy-cooking notebook and store it in a designated place to quickly reference anytime.”"},{"tipId":"16","tips":"Carry snacks with you.\r\nIf you really don’t have time for a meal, you want to make sure you at least have some healthy snacks you can grab to keep yourself satiated until you can sit down for a proper meal. Spence suggests stocking up on and carrying portable snacks that can curb hunger and fuel you quickly on the go. “I like to stash granola bars in my bags so I always have something ‘just in case.’ Other great options are pre-mixing trail mix with a combo of cereal, nuts, dried fruit, chocolate chips, seeds, etc.,” she suggests."},{"tipId":"17","tips":"Read the full recipe before cooking. This seems so simple, but sometimes we get in such a rush to cook that we forget to read the recipe before starting. Keep a time-consuming step from blindsiding you by reading through the whole recipe before you start. That way, you'll be prepared for any daunting step before you get to it. Want to really be prepared? Use this read-ahead time to assemble your ingredients in prep bowls so you won't be digging through your spice cabinet at the last second."}]},{"title":"Technology","tipsCount":"9 Hacks","imagePath":"images/tech.jpg","informationList":[{"tipId":"1","tips":"Tap the spacebar to scroll down a page online"},{"tipId":"2","tips":"Hold shift while taping the spacebar to scroll back up the page"},{"tipId":"3","tips":"If you want larger text on a webpage, hold CTRL and “+”; to make it smaller hold CTRL and “– “"},{"tipId":"4","tips":"Want a definition online? Type the word “define” followed by the word in Google to learn what it means"},{"tipId":"5","tips":"CTRL + Spacebar selects entire columns in Excel"},{"tipId":"6","tips":"CTRL plus the Spacebar selects entire columns in Excel"},{"tipId":"7","tips":"Need to do it on a Mac? Use Command-Shift-3 (entire screen) Command-Shift-4 (section tool)"},{"tipId":"8","tips":"“K” will pause and play that YouTube video you’re watching"},{"tipId":"9","tips":"“L” will do a 10 second fast forward and “J” will complete a 10-second rewind on YouTube"}]},{"title":"Saving Money On Travel  ","tipsCount":"14 Hacks","imagePath":"images/travel.jpg","informationList":[{"tipId":"1","tips":"Generally, flying earlier in the week (Monday or Tuesday vs. Thursday or Friday) translates to better deals, and the second flight of the day is less expensive than the first."},{"tipId":"2","tips":"Little, rentable mobile routers — nicknamed 'pocket WiFi' — are becoming more available in places like Europe and Japan. Typically you reserve one, then pick it up at the airport or have it delivered to your hotel. They cost a low per-day fee, and will save you from international roaming charges, paying for hotel WiFi if it’s not gratis, or having to buy a coffee every time you want to use a cafe’s WiFi but you realize that it’s password protected so you can't 'borrow' it from outside."},{"tipId":"3","tips":"You can’t negotiate with a computer. So even if you’ve booked online, I’d suggest trying to negotiate upgrades or special requests — like a late checkout — in person. You’re more likely to get the best possible deal when you’re talking to someone (kindly) face to face."},{"tipId":"4","tips":"There’s no better way to get to know a new city than by walking everywhere. That you’ll end up saving a fortune in taxis is a nice bonus. And when you do need a ride, opt for public transportation and know that frequent-travel cards — the Oyster card in London, the Octopus in Hong Kong — are much smarter than single fares."},{"tipId":"5","tips":"<b>Do not touch your mini-bar</b>This is not a tip, it is gospel! Opening the mini bar in a Indian hotel room comes with a host of other problems – one of them being a hefty addition to your bill. And don’t think you can use the snacks and beverages in a crunch and replace them with the same from the market – the scheming authorities stamp the stuff!"},{"tipId":"6","tips":"<b>Travel off-season</b>Off-season is actually on-season where India is concerned. Rest assured; you will save a chunk of change if you book when the herd is not heading toward India. Hotels, even luxurious and unaffordable five star ones welcome you with package deals, and wait on you hand and foot. Take for example the ridiculously expensive hotels in Goa, Rajasthan and Kerala"},{"tipId":"7","tips":"<b>Don’t wait to book your flights</b>Most domestic airlines in India offer discounts if you book in advance. So get onto the net and book your seats well in time, because fares keep getting pricier as the date of journey approaches. You will end up paying about half of what a last minute ticket will cost you! Another trick is to book mid-day flights – other than the fact that it shaves precious sightseeing hours off your itinerary, it definitely adds to your savings account! Mid-day flights are way cheaper than early morning or later in the evening flights. So eat your lunch en route! Another good idea is to avoid weekend flights – more the demand, higher the price."},{"tipId":"8","tips":"<b>Grab a holiday package</b>Take advantage of today’s sluggish economy and go for the flight plus hotel combos that online travel agents don’t seem to tire of advertising. These combination deals help you save around 30% as compared to separate bookings. Also get lucky with packages that offer flights with multiple destinations. So keep a lookout for your online bonanza!"},{"tipId":"9","tips":"<b>The upside of taking the train</b>This tip is not for those unfamiliar with the Indian Railways or for those who recoil in horror at the sight of a typical Indian city railway station. For the rest of us, it is business as usual – travelling by train around India is pretty safe and very economical. More plus points are the view and the unprecedented local interaction one experiences. Catching a night train gives you a double boost in terms of saving hotel money for the night and increasing your sightseeing hour quota. Hot tip though – avoid shady people offering you snacks or drinks!"},{"tipId":"10","tips":"<b>Book with breakfast</b>Single out hotels that offer one meal in the tariff – preferably breakfast – we’re hoping the rest of the day is spent sightseeing! Room service can be quite prohibitive, plus how dull is it to miss out on local food?"},{"tipId":"11","tips":"<b>Carry your own food</b>In no way are we suggesting that you pass up local delicacies for packaged, instant food. We merely advise that you have a back-up in case you find yourself in a situation where the only culinary option is prohibitively expensive. If you’re in the mountains, then you must carry emergency ration; but elsewhere, not so much. Digging into local street food really helps save money, but remember you’ve got to have the stomach for it – literally!"},{"tipId":"12","tips":"<b>Educate yourself in car rentals</b>Don’t get conned by cunning taxi drivers – try to book your cabs online through known companies. It is safer, cheaper and more reliable. If you must book a local; go for a diesel vehicle – it is way cheaper. If you are on your own, give a two wheeler a shot – less cumbersome and easier on the pocket."},{"tipId":"13","tips":"<b>Your guide/driver is not a culinary or shopping specialist</b>Never ever shop or eat at places recommended by your guide or cabbie – they are bound to have a commission on the bill you generate. A good idea is to check with locals or fellow tourists."},{"tipId":"14","tips":"<b>Bargain till you drop</b>Use the gift of the gab and knock that price down! It could be room rent, cab fare, or souvenir shopping – a good bargain never hurt anyone. If you don’t manage a reduction in rate, you will certainly be offered an upgrade of a free gift."}]}]
